import telebot
from difflib import get_close_matches

bot = telebot.TeleBot('5947641631:AAHhozblIXGyJFSYXC5L5_ienRZ-mAMG0ps')
user_state = {}

# Список вопросов и ответов, с которыми работает бот
questions = {
    'Здравствуйте, рассматриваем поступление в ваш колледж, но мы проживаем в другом регионе, нужна ли обязательная московская прописка для этого?  ': 'Здравствуйте, подача и регистрация заявлений на обучение по профессиональным образовательным программам среднего профессионального образования, реализуемым за счет бюджета города Москвы может быть произведена только через официальный сайт Мэра Москвы www.mos.ru путем заполнения электронного заявления. Регистрация электронного заявления на Портале производится автоматически при условии полного и корректного заполнения поступающим всех требуемых полей интерактивной формы.',
    'Не могу найти на сайте регистрацию на день открытых дверей, подскажите, пожалуйста, как ее осуществить?': 'Ссылка для регистрации указана на сайте в разделе "Поступление в колледж", "Дни открытых дверей". Также дублирую ссылку для Вашего удобства: https://clck.ru/33KNEN',
    'к вам можно поступить если прописка Московской области?': 'Подача и регистрация заявлений на обучение по профессиональным образовательным программам среднего профессионального образования, реализуемым за счет бюджета города Москвы может быть произведена только через официальный сайт Мэра Москвы www.mos.ru путем заполнения электронного заявления.Регистрация электронного заявления на Портале производится автоматически при условии полного и корректного заполнения поступающим всех требуемых полей интерактивной формы.',
    "Ваш колледж государственный?": "Да, Колледж сферы услуг № 10является Государственным бюджетным профессиональным образовательным учреждением, учредителем которого является Департамент образования и науки города Москвы.",
    'какие нужны результаты ОГЭ/аттестата для поступления в ваш колледж в следующем году' : 'Поступление осуществляется на основании среднего балла аттестата. Проходные баллы на 2022-2023 учебный год, Вы можете посмотреть по ссылке:https://ksu10.mskobr.ru/files/advert/Itogi_nabora_2022.pdf',
    "Какой документ получают выпускники колледжа?" : "Выпускники колледжа получают диплом государственного образца о среднем профессиональном образовании.",
    "Можно ли перевестись из другого колледжа?" : "Возможен перевод студентов из других учебных заведений среднего профессионального образования и высшего профессионального образования на специальности, профессии и формы обучения, реализуемые колледжем. Колледж осуществляет прием студентов на основании академических справок установленного образца. Все вопросы, касающиеся перевода, можно уточнить по телефону 8 499 977 59 71",
    "Можно ли перевестись из другого Коллежа на специальность, по которой в КСУ №10 проводится обучение, на бюджетное место?": "Перевод возможен при соблюдении двух условий:Наличие свободных бюджетных мест; Московская регистрация. Все вопросы, касающиеся перевода, можно уточнить по телефону 8 499 977 59 71",
    "Какие документы необходимо предоставить в Приемную комиссию?" : "Выпускникам 9-х и 11-х классов в Приемную комиссию необходимо предоставить:1. Подлинник аттестата (или его копию*)2. Паспорт (документ, удостоверяющий личность) и его копию3. 4 фотографии 3х44. СНИЛС (или его копию)5. ИНН (или его копию)6. Полис медицинского страхования (или его копию)7. Свидетельство о рождении (или его копию)8. Для юношей: копия приписного свидетельства или военного билета (при наличии)9. Документы, предусматривающие льготы (при наличии)10. Медицинскую справку № 086-уВам необходимо пройти медицинский осмотр у следующих врачей:11. терапевт;12. хирург;13. невролог;14. оториноларинголог;15. офтальмолог;16. дерматовенеролог;17. стоматолог;18. психиатр.",
    "Нужна ли медицинская справка для поступления в Колледж?" : 'Медицинская справка установленного образца: форма 086-У. Справка берется бесплатно у участкового врача, либо в частных мед. учреждениях.',
    "Где проходят занятия?": 'Студенты занимаются в нескольких учебных корпусах в зависимости от курса и выбранной программы подготовки. Занятия проходят по адресам:1 Учебный корпус (Центральная приемная комиссия)м. Тимирязевская Дмитровское шоссе, дом 11А Повар, кондитерПоварское и кондитерское дело2 Учебный корпус МЦК Панфиловская, м. Октябрьское поле, м. Сокол, ул. Панфилова, д.6Повар, кондитерПоварское и кондитерское дело3 Учебный корпус м. Верхние Лихоборы, м. Селигерская, Дмитровское шоссе, д. 79Поварское и кондитерское дело (1 курс)Туризм и гостеприимствоИнформационные системы и программированиеТехнология индустрии красотыКоммерцияПарикмахер',    "" : '',
    "Обучение в Колледже платное?" : 'Обучение в Коллеже реализуется как на бюджетной, так и на внебюджетной основе. Оплату можно производить помесячно, за полгода, за год, за весь период обучения, как удобно плательщику.  Также оплатить учебу можно материнским капиталом.',
    "Какие вступительные экзамены нужно сдавать при поступлении в Колледжа?" : 'Поступление осуществляется на основании конкурса средних баллов аттестата.Поступление на специальности : «Технология индустрии красоты» и «Парикмахер» включает творческое вступительное испытание, с использованием дистанционных технологий - задание на выявление творческих способностей.',
    "Предоставляется ли иногородним общежитие?" : 'Нет, общежитием Колледж не располагает.',
    "В какой период подаются документы?" : 'С 20 июня 2023 г. - 15 августа 2023 г. - прием заявлений в Колледж для получения образования по очной форме обучения. До 25 ноября 2023 г. – продление набора при наличии свободных мест.20 июня 2023 г. - 15 августа 2023 г. - Прием и регистрация заявлений через портал www.mos.ru  ',
    "Может ли абитуриент поступать в ВУЗ после получения среднего профессионального образования, не сдавая ЕГЭ?" : 'Да, может. Для этого необходимо сдать внутренние вступительные испытания. Перечень вступительных испытаний для каждой специальности необходимо смотреть на сайте ВУЗов',
    "Возможно ли поступить на платное, а потом перевестись на бюджет?" : 'Возможно, при наличии вакантных бюджетных мест и при хорошей успеваемости',
    "Я живу в другой области, могу ли я учиться у вас?": 'Да, можете, при наличии московской регистрации. Общежитие колледж не предоставляет.',
    "Я – иностранец. Могу ли я получить образование в вашем колледже?": 'Да, конечно. Колледж принимает иностранных граждан на внебюджетную (платную) основу, в соответствии с требованиями приема иностранных граждан.',
    "Мы – многодетная семья (малообеспеченная, неполная, иная соц. группа). Можем ли мы получить льготу по оплате за обучение?": 'Для таких категорий граждан поступление осуществляется на общих основаниях. При поступлении возможна выплата социальной стипендии.',
    "Верно ли, что подготовительные курсы увеличивают шансы при поступлении?": 'Нет, подготовительные курсы не влияют на поступления. Абитуриенты, прошедшие курсы подготовки к ОГЭ в КСУ №10, поступают на общих основаниях.',
    "Где студенты колледжа проходят практику?": 'Распределение по местам прохождения учебной и производственной практик определяются спецификой специальностей и профессий, стандартами и требованиями учебных планов. Вы можете посмотреть наших работодателей-партнеров по ссылке:https://clck.ru/348srZ ',
    "Можно ли совмещать учебу в колледже с работой?": 'Можно, но только в том случае, если работа вам не помешает соблюдать расписание занятий и выполнять домашние задания. Многие студенты старших курсов в процессе обучения уже начинают работать по специальности, но только соблюдая вышеназванные условия.',
    "Сложно ли после окончания колледжа устроиться на работу по специальности?": 'Колледж гарантирует содействие в трудоустройстве после окончания колледжа. В колледже работает отдел трудоустройства, который располагает обширным банком вакансий наших социальных партнеров.',
    "Можно ли поступить в Колледж на базе 8 класса?": 'Нет, поступление возможно только на базе 9 или 11 класса. ',
    "Можно ли поступить в колледж на заочную форму обучения, чтобы в дальнейшем обучаться дистанционно?": 'Да, можно. Очно-заочное обучение:09.02.07 Информационные системы и программирование, 9 класс, 3 года 11 месяцев09.02.07 Информационные системы и программирование, 11 класс, 2 года 11 месяцевЗаочное обучение:38.02.04 Коммерция, 9 класс, 2 года 11 месяцев38.02.04 Коммерция, 11 класс, 1 год 11 месяцев',
    "Предоставляется ли отсрочка от армии на период обучения?": 'Да, на весь период по очной форме обучения предоставляется отсрочка от армии в соответствии с федеральным законом о воинской обязанности и военной службе.',
    "Как считается средний балл аттестата": 'Вам нужно подсчитать общее количество оценок, сложить все оценки вместе (найти сумму всех оценок) и разделить эту сумму на общее количество оценок. Полученное число и будет средним баллом Вашего аттестата. Средний балл ведется с точностью до сотых долей.Например: В Вашем аттестате стоят оценки по 12 предметам. Из них 5 пятерок, 3 четверки и 4 тройки. Найдем сумму всех оценок 5*5 + 4*3 + 3*4 = 25 + 12+ 12= 49. Разделим сумму всех оценок на количество предметов: 49 : 12= 4.08. Таким образом, средний балл Вашего аттестата – 4.08',
    "Какие проходные баллы в прошлом году?": 'С проходными баллами прошлого года Вы можете ознакомиться по ссылке:https://clck.ru/348tAR ',
    "Какие документы необходимо предоставить для поступления абитуриентам с ограниченными возможностями?": 'Абитуриенты должны предоставить стандартный комплект документов, а также справку об инвалидности, форму индивидуальной программы реабилитации или абилитации инвалида, выдаваемую федеральными государственными учреждениями медико-социальной экспертизы',
    "Есть ли льготы для инвалидов при поступлении в колледж?": 'Да есть, для инвалидов на бюджетной основе выделяется квота на обучение в рамках бюджетных мест. Например: По направлению КЦП 50 мест, из них 5 мест для абитуриентов с инвалидностью – это значит, что они участвуют только в конкурсе на 5 мест (балл значительно ниже)',
    "Как я узнаю о дате вступительных испытаний?": 'Информирование проходит при подаче документов, а также приемная комиссия дублирует информацию за 5-6 дней до экзамена.',
    "Нужна ли регистрация в Москве?": 'Для подачи документов на бюджет необходимо иметь временную или постоянную регистрацию по месту пребывания в Москве. Для подачи документов на внебюджет регистрация в Москве не обязательна.',
    "Есть ли льгота при поступлении на бюджет для детей сирот, находящихся под опекой. А если ребенок (сирота) поступил на платное отделение, то есть ли льгота при оплате?": 'Колледж льгот не предоставляет. Поступление осуществляется на общих основаниях.',
    "Можно ли подать документы на несколько специальностей?": 'Да, это возможно. Но зачисление на обучение возможно только на одну специальность.',
    "Выдается ли льготный проездной билет студентам колледжа?": 'Конечно. Социальную карту можно оформить на Официальном портале Мэра и Правительства Москвы (mos.ru)',

}

start_keyboard = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True)
start_keyboard.add("Даю согласие", "Открыть согласие на обработку данных")

agree_keyboard = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True)
agree_keyboard.add("Задать вопрос", "Как пользоваться", "Задать вопрос специалисту")

question_keyboard = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True)
question_keyboard.add("Назад")

waiting_for_question = False

@bot.message_handler(func=lambda message: message.text == 'Задать вопрос специалисту')
def spec(message, f=0):
    global waiting_for_question
    waiting_for_question = True
    bot.send_message(message.chat.id, "Напишите свой вопрос")
    f += 1
    if f >= 1:
        @bot.message_handler(func=lambda message: True)
        def send_question_to_specialist(message):
            global waiting_for_question
            if waiting_for_question:
                # Получаем информацию о пользователе, отправившем сообщение
                user_info = (f"@{message.from_user.username} (id: {message.from_user.id})")
                # Сохраняем id чата с пользователем, чтобы отправить ответ в тот же чат
                chat_id = message.chat.id

                # Отправляем сообщение специалисту
                specialist_id = 1629201925
                bot.send_message(specialist_id, f"Получен новый вопрос:\n\n{message.text}\n\n{user_info}")

                # Отправляем сообщение пользователю, что его вопрос был успешно отправлен специалисту
                bot.send_message(chat_id, "Ваш вопрос был успешно отправлен специалисту. Спасибо!", reply_markup=agree_keyboard)
                bot.send_message(chat_id, "Напишите ")

                # Сбрасываем значение переменной waiting_for_question
                waiting_for_question = False
                return f





@bot.message_handler(commands=['start'])
def send_welcome(message):
    bot.send_message(message.chat.id, 'Привет,')
    bot.send_message(message.chat.id, "Ты должен дат согласие, на обработку данных напишите "" (Даю согласие)"" , а если хочешь прочитать напиши "' (Открыть согласие на обработку данных)', reply_markup=start_keyboard)


@bot.message_handler(func=lambda message: message.text == 'Как пользоваться')
def helper(message):
    bot.send_message(message.chat.id, "На ваш выбор", reply_markup=agree_keyboard)

# Функция для поиска ближайшего совпадения в списке вопросов
def get_matching_question(question):
    matches = get_close_matches(question, questions.keys(), n=1, cutoff=0.5)
    if matches:
        return matches[0]
    else:
        return None

@bot.message_handler(func=lambda message: message.text == 'Назад')
def back_to_start(message):
    bot.send_message(message.chat.id, "вы вернулсь в главное меню", reply_markup=agree_keyboard)
    bot.send_message(message.chat.id, "Напишите ""(Задать вопрос)"" если хотите задать вопрос"" если хотите позвать оператора, напишите ""(Задать вопрос специалисту)",reply_markup=agree_keyboard)


@bot.message_handler(func=lambda message: message.text == 'Открыть согласие на обработку данных')
def sika(message):
    bot.send_message(message.chat.id, "много скучного текста", reply_markup=start_keyboard)

@bot.message_handler(func=lambda message: message.text == 'Даю согласие')
def agree(message):
    bot.send_message(message.chat.id, "Напишите ""(Задать вопрос)"" если хотите задать вопрос"" если хотите позвать оператора, напишите ""(Задать вопрос специалисту)", reply_markup=agree_keyboard)


# Функция для обработки сообщений с текстом
# Обработчик нажатия на кнопку "Задать вопрос"
@bot.message_handler(func=lambda message: message.text == 'Задать вопрос')
def ask_question(message):
    # Сохраняем состояние ожидания вопроса для этого пользователя
    user_state[message.chat.id] = 'waiting_question'
    bot.send_message(message.chat.id, "Введите свой вопрос:", reply_markup=question_keyboard)

# Обработчик текстовых сообщений
@bot.message_handler(func=lambda message: message.chat.id in user_state and user_state[message.chat.id] == 'waiting_question')
def handle_question(message):
    chat_id = message.chat.id
    question = message.text

    # Поиск ответа на вопрос в списке вопросов
    matching_question = get_matching_question(question)
    if matching_question:
        answer = questions[matching_question]
        bot.send_message(chat_id, answer, reply_markup=agree_keyboard)
        bot.send_message(message.chat.id,"Напишите ""(Задать вопрос)"" если хотите задать вопрос"" если хотите позвать оператора, напишите ""(Задать вопрос специалисту)",reply_markup=agree_keyboard)
    else:
        bot.send_message(chat_id, "Не найден вопрос", reply_markup=agree_keyboard)
        bot.send_message(message.chat.id,"Напишите ""(Задать вопрос)"" если хотите задать вопрос"" если хотите позвать оператора, напишите ""(Задать вопрос специалисту)",reply_markup=agree_keyboard)

    # Сбрасываем состояние ожидания вопроса для этого пользователя
    user_state[chat_id] = None


# # Функция для обработки нажатий на кнопки меню
# @bot.callback_query_handler(func=lambda call: True)
# def handle_menu(call):
#     chat_id = call.message.chat.id
#     question = call.message.text
#
#     # Отправить сообщение со вопросом и контактами специалисту
#     specialist_contact = '1629201925'
#     specialist_message = f'Вопрос: {question}\nКонтакты: {call.from_user.username}'
#     bot.send_message(specialist_contact, specialist_message)
#     bot.send_message(chat_id, 'Ваш вопрос был отправлен специалисту. '
#                               'Он свяжется с вами в ближайшее время.')


bot.polling()
